andersenthomas98/masteroppgave/nrf5sdk_thread/examples/thread/freertos_mqttsn/pca10056/blank/ses/thread_mqttsn.c
#include "thread_mqttsn.h"
#include "mqttsn_client.h"
#include "thread_utils.h"
#include "bsp_thread.h"
#include "FreeRTOS.h"
#include "queue.h"
#include "task.h"
#include "semphr.h"
#include "event_groups.h"
#include "nrf_log.h"
#include "app_scheduler.h"
#include "app_timer.h"
#include "mqttsn_platform.h"
#include <openthread/thread.h>
#include "message_buffer.h"
#include <string.h>
#include <inttypes.h>
#include "robot_config.h"

#define SCHED_QUEUE_SIZE       32                                           /**< Maximum number of events in the scheduler queue. */
#define SCHED_EVENT_DATA_SIZE  APP_TIMER_SCHED_EVENT_DATA_SIZE              /**< Maximum app_scheduler event size. */

#define ROBOT_TOPIC_NAME              "v2/robot/NRF_5/adv"
#define ROBOT_LINE_TOPIC_NAME         "v2/robot/NRF_5/line"
#define ROBOT_CTRL_TOPIC_NAME         "v2/robot/NRF_5/controller"
#define ROBOT_DBSCAN_TOPIC_NAME       "v2/robot/NRF_5/DBSCAN"
#define ROBOT_IEPF_TOPIC_NAME         "v2/robot/NRF_5/IEPF"
#define ROBOT_MSE_TOPIC_NAME          "v2/robot/NRF_5/MSE"
#define ROBOT_MERGE_TOPIC_NAME        "v2/robot/NRF_5/merge"
#define ROBOT_JOIN_TOPIC_NAME         "v2/robot/NRF_5/join"
#define ROBOT_POINT_TOPIC_NAME        "v2/robot/NRF_5/point"
#define SERVER_CMD_TOPIC_NAME         "v2/server/NRF_5/cmd"
#define SERVER_INIT_TOPIC_NAME        "v2/server/NRF_5/init"
#define NUM_TOPICS                    11                                    /** Publish topics + subscribe topics need to be registered by gateway*/
#define NUM_SUB_TOPICS                2

#define SEARCH_GATEWAY_TIMEOUT        5                                     /**< MQTT-SN Gateway discovery procedure timeout in [s]. */
#define MQTTSN_TASK_DELAY_S           0.1                                   /**< MQTTSN task delay in milliseconds */ 

extern TaskHandle_t thread_stack_task_handle, mqttsn_task_handle;

SemaphoreHandle_t registerTopicSemaphore;
EventGroupHandle_t connectEventGroup;
uint8_t has_finished_connected_callback = 0;

static mqttsn_client_t      m_client;                                       /**< An MQTT-SN client instance. */
static mqttsn_remote_t      m_gateway_addr;                                 /**< A gateway address. */
static uint8_t              m_gateway_id;                                   /**< A gateway ID. */
static mqttsn_connect_opt_t m_connect_opt;                                  /**< Connect options for the MQTT-SN client. */
static uint16_t             m_msg_id           = 0;                         /**< Message ID thrown with MQTTSN_EVENT_TIMEOUT. */
static char                 m_client_id[]      = ROBOT_NAME;                /**< The MQTT-SN Client's ID. */

static mqttsn_topic_t topic_arr[NUM_TOPICS] =                               /** Publish topics + subscribe topics need to be registered by gateway*/
{
  {
    .p_topic_name = ROBOT_TOPIC_NAME, 
    .topic_id     = NULL
  },
  {
    .p_topic_name = SERVER_CMD_TOPIC_NAME, 
    .topic_id     = NULL
  }, 
  {
    .p_topic_name = SERVER_INIT_TOPIC_NAME,
    .topic_id     = NULL
  }, 
  {
    .p_topic_name = ROBOT_CTRL_TOPIC_NAME,
    .topic_id     = NULL
  },
  {
    .p_topic_name = ROBOT_LINE_TOPIC_NAME,
    .topic_id     = NULL
  },
  {
    .p_topic_name = ROBOT_DBSCAN_TOPIC_NAME,
    .topic_id     = NULL
  },
  {
    .p_topic_name = ROBOT_IEPF_TOPIC_NAME,
    .topic_id     = NULL
  },
  {
    .p_topic_name = ROBOT_POINT_TOPIC_NAME,
    .topic_id     = NULL
  },
  {
    .p_topic_name = ROBOT_MSE_TOPIC_NAME,
    .topic_id     = NULL
  },
  {
    .p_topic_name = ROBOT_MERGE_TOPIC_NAME,
    .topic_id     = NULL
  },
  {
    .p_topic_name = ROBOT_JOIN_TOPIC_NAME,
    .topic_id     = NULL
  }
};

typedef struct mqttsn_subscribe_topic {
  QueueHandle_t queue;
  uint8_t queue_size;
  mqttsn_topic_t* p_topic;
  uint8_t identifier;
}mqttsn_subscribe_topic_t;


static mqttsn_subscribe_topic_t sub_topic_arr[NUM_SUB_TOPICS] = {
  {
    .queue = NULL,
    .queue_size = 1,
    .p_topic = &topic_arr[1], // pointer to v2/server/<ROBOT_NAME>/cmd topic
    .identifier = TARGET_IDENTIFIER
  }, 
  {
    .queue = NULL,
    .queue_size = 1,
    .p_topic = &topic_arr[2], // pointer to v2/server/ROBOT_NAME>/init topic
    .identifier = INIT_IDENTIFIER
  }
};

QueueHandle_t mqttsn_outgoing_message_queue, 
              mqttsn_outgoing_line_message_queue, 
              mqttsn_outgoing_update_message_queue, 
              mqttsn_outgoing_cluster_message_queue;

SemaphoreHandle_t publish_semaphore;

QueueHandle_t get_queue_handle(char* topic_name) {
  for (uint8_t i=0; i<NUM_SUB_TOPICS; i++) {
    if (!strcmp(sub_topic_arr[i].p_topic->p_topic_name, topic_name)) {
      return sub_topic_arr[i].queue;
    }
  }
}

/***************************************************************************************************
 * @section MQTT-SN
 **************************************************************************************************/


 /**@brief Get topic id for given topic name. 
 * @param[in]    p_topic_name  Pointer to topic name.
 */
uint16_t get_topic_id(char* p_topic_name) {
  for (uint8_t i=0; i<NUM_TOPICS; i++) {
    if (!(strcmp(p_topic_name, topic_arr[i].p_topic_name))) {
      return topic_arr[i].topic_id;
    }
  }
  NRF_LOG_WARNING("Given topic name is not a registered topic");
  return NULL;
}


/**@brief Initializes MQTT-SN client's connection options. */
static void connect_opt_init(void)
{
    m_connect_opt.alive_duration = MQTTSN_DEFAULT_ALIVE_DURATION,
    m_connect_opt.clean_session  = MQTTSN_DEFAULT_CLEAN_SESSION_FLAG,
    m_connect_opt.will_flag      = MQTTSN_DEFAULT_WILL_FLAG,
    m_connect_opt.client_id_len  = strlen(m_client_id),

    memcpy(m_connect_opt.p_client_id,  (unsigned char *)m_client_id,  m_connect_opt.client_id_len);
}

/**@brief Processes GWINFO message from a gateway.
 *
 * @details This function updates MQTT-SN Gateway information.
 *
 * @param[in]    p_event  Pointer to MQTT-SN event.
 */
static void gateway_info_callback(mqttsn_event_t * p_event)
{
    m_gateway_addr  = *(p_event->event_data.connected.p_gateway_addr);
    m_gateway_id    = p_event->event_data.connected.gateway_id;
}


/**@brief Processes CONNACK message from a gateway.
 *
 * @details This function launches the topic registration procedure if necessary.
 */
static void connected_callback(void)
{
    
