andersenthomas98/masteroppgave/nrf5sdk_thread/examples/thread/freertos_mqttsn/pca10056/blank/ses/thread_mqttsn.c
    // Register topics, i.e. bind long topic name to id specified by broker
    for (uint8_t i=0; i<NUM_TOPICS; i++) {
      mqttsn_topic_t topic = topic_arr[i];
      NRF_LOG_INFO("Request to register topic %s", NRF_LOG_PUSH(topic.p_topic_name));
      uint32_t err_code = mqttsn_client_topic_register(&m_client,
                                                       topic.p_topic_name,
                                                       strlen(topic.p_topic_name),
                                                       &m_msg_id);
      if (err_code != NRF_SUCCESS)
      {
          NRF_LOG_ERROR("REGISTER message could not be sent. Error code: 0x%x\r\n", err_code);
      }
    }

    // Subscribe to topics
    for (uint8_t i=0; i<NUM_SUB_TOPICS; i++) {
      mqttsn_topic_t* p_topic = sub_topic_arr[i].p_topic;
      uint32_t err_code = mqttsn_client_subscribe(&m_client, p_topic->p_topic_name, strlen(p_topic->p_topic_name), &m_msg_id);
      if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("SUBSCRIBE message could not be sent.\r\n");
      }
    }

    has_finished_connected_callback = 1;

}


/**@brief Processes DISCONNECT message from a gateway. */
static void disconnected_callback(void)
{
    NRF_LOG_INFO("MQTT-SN event: Disconnected");
}

uint8_t all_topics_registered() {
  for (uint8_t i=0; i<NUM_TOPICS; i++) {
    if (topic_arr[i].topic_id == NULL) {
      // Not all topics have been registered
      return 0;
    }
  }
  // All topics have been registered
  return 1;

}


/**@brief Processes REGACK message from a gateway.
 *
 * @param[in] p_event Pointer to MQTT-SN event.
 */
static void regack_callback(mqttsn_event_t * p_event)
{
    mqttsn_topic_t registered_topic = p_event->event_data.registered.packet.topic;
    for (int8_t i=0; i<NUM_TOPICS; i++) {
      if (!strcmp(registered_topic.p_topic_name, topic_arr[i].p_topic_name)) {
        // Set topic id corresponding to registered topic name
        mqttsn_topic_t* p_topic = &topic_arr[i];
        p_topic->topic_id = registered_topic.topic_id;
        break;
      }
    }
    NRF_LOG_INFO("MQTT-SN event: Topic %s has been registered with ID: %d.\r\n", 
                  NRF_LOG_PUSH(p_event->event_data.registered.packet.topic.p_topic_name),
                  p_event->event_data.registered.packet.topic.topic_id); 
    if (all_topics_registered()) {

      // Start main loop of mqttsn task
      UNUSED_RETURN_VALUE(xTaskNotifyGive(mqttsn_task_handle));
    
    }

}


/**@brief Processes data published by a broker. */
static void received_callback(mqttsn_event_t * p_event)
{
    for (uint8_t i=0; i<NUM_SUB_TOPICS; i++) {
      mqttsn_subscribe_topic_t sub_topic = sub_topic_arr[i];
      
      // Find a match for topic id
      if (p_event->event_data.published.packet.topic.topic_id == sub_topic.p_topic->topic_id) {

        // The value which p_payload points to must be copied, since the pointer value 
        // may be overwritten with new data before the receiving task has read it
        uint8_t* payload = p_event->event_data.published.p_payload;

        switch(sub_topic.identifier) {
          case INIT_IDENTIFIER: 
            {
              mqttsn_init_msg_t rx_init_msg;
              memcpy(&rx_init_msg, payload, sizeof(mqttsn_init_msg_t));
              if (xQueueSend(sub_topic.queue, (void*)&rx_init_msg, 0) != pdPASS) {
                NRF_LOG_ERROR("Failed to post received payload from topic %s to queue", NRF_LOG_PUSH(sub_topic.p_topic->p_topic_name));
              }
              break;
            }
          case TARGET_IDENTIFIER:
          {
            mqttsn_target_msg_t rx_target_msg;
            memcpy(&rx_target_msg, payload, sizeof(mqttsn_target_msg_t));
            if (xQueueSend(sub_topic.queue, (void*)&rx_target_msg, 0) != pdPASS) {
              NRF_LOG_ERROR("Failed to post received payload from topic %s to queue", NRF_LOG_PUSH(sub_topic.p_topic->p_topic_name));
            }
            break;
          }
        
        }
        break; // exit for-loop
      }
    }
}


/**@brief Processes retransmission limit reached event. */
static void timeout_callback(mqttsn_event_t * p_event)
{
    NRF_LOG_INFO("MQTT-SN event: Timed-out message: %d. Message ID: %d.\r\n",
                  p_event->event_data.error.msg_type,
                  p_event->event_data.error.msg_id);

   switch(p_event->event_data.error.msg_type) {
    case MQTTSN_PACKET_CONNACK:
      NRF_LOG_WARNING("CONNACK not received, retrying connect...");
      uint32_t err_code = mqttsn_client_connect(&m_client, &m_gateway_addr, m_gateway_id, &m_connect_opt);
      if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("CONNECT message could not be sent. Error: 0x%x\r\n", err_code);
      }
      break;
    case MQTTSN_PACKET_PUBACK:
      switch(p_event->event_data.error.error) {
        case MQTTSN_ERROR_REJECTED_CONGESTION:
          NRF_LOG_WARNING("PUBACK not received due to network congestion");
          // TODO
          break;
        case MQTTSN_ERROR_TIMEOUT:
          NRF_LOG_WARNING("PUBACK not received due to timeout");
          // TODO
          break;
      }
      break;
    case MQTTSN_PACKET_PINGREQ:
      NRF_LOG_ERROR("PINGREQ not received, trying to reconnect...");
      mqttsn_client_disconnect(&m_client); // main loop of mqttsn task will try to reconnect
      break;
   }
   

}


/**@brief Processes results of gateway discovery procedure. */
static void searchgw_timeout_callback(mqttsn_event_t * p_event)
{
    NRF_LOG_INFO("MQTT-SN event: Gateway discovery result: 0x%x.\r\n", p_event->event_data.discovery);
    // Notify mqttsn task
    //UNUSED_RETURN_VALUE(xTaskNotifyGive(mqttsn_task_handle));
    uint32_t err_code;

    switch(p_event->event_data.discovery) {
      
      case MQTTSN_SEARCH_GATEWAY_FINISHED:
        // TODO
        break;
      
      case MQTTSN_SEARCH_GATEWAY_NO_GATEWAY_FOUND:
        NRF_LOG_INFO("Retrying gateway search...\n\r");
        err_code = mqttsn_client_search_gateway(&m_client, SEARCH_GATEWAY_TIMEOUT);
        if (err_code != NRF_SUCCESS) {
          NRF_LOG_ERROR("SEARCH GATEWAY message could not be sent. Error: 0x%x\r\n", err_code);
        }
        break;

      case MQTTSN_SEARCH_GATEWAY_PLATFORM_FAILED:
        NRF_LOG_ERROR("Search gateway platform failed\n\r");
        // TODO
        break;

