andersenthomas98/masteroppgave/nrf5sdk_thread/examples/thread/freertos_mqttsn/pca10056/blank/ses/thread_mqttsn.c
    NRF_LOG_ERROR("Failed to post mqttsn message to outgoing message queue");
  
  }
  return NRF_SUCCESS;

}

uint32_t publish_update(char* topic_name, mqttsn_update_msg_t payload, uint8_t payload_size, uint8_t qos, uint16_t msg_id) {
  if (!mqttsn_client_is_connected()) {
    return NRF_ERROR_BUSY;
  }
  
  mqttsn_update_msg_queue_element_t queue_element;
  queue_element.msg_id = msg_id;
  queue_element.qos = qos;
  queue_element.payload_size = payload_size;
  queue_element.payload = payload;
  queue_element.topic_id = get_topic_id(topic_name);
  if (queue_element.topic_id == NULL) {
    return NRF_ERROR_NULL;
  }

  if (mqttsn_outgoing_update_message_queue != NULL && xQueueSend(mqttsn_outgoing_update_message_queue, &queue_element, 10) != pdPASS) {
    
    NRF_LOG_ERROR("Failed to post mqttsn message to outgoing message queue");
  
  }
  return NRF_SUCCESS;

}

uint32_t publish_cluster_point(char* topic_name, mqttsn_cluster_msg_t payload, uint8_t payload_size, uint8_t qos, uint16_t msg_id) {
  
  if (!mqttsn_client_is_connected()) {
    return NRF_ERROR_BUSY;
  }
  
  mqttsn_cluster_msg_queue_element_t queue_element;
  queue_element.msg_id = msg_id;
  queue_element.qos = qos;
  queue_element.payload_size = payload_size;
  queue_element.payload = payload;
  queue_element.topic_id = get_topic_id(topic_name);
  if (queue_element.topic_id == NULL) {
    return NRF_ERROR_NULL;
  }

  if (mqttsn_outgoing_cluster_message_queue != NULL && xQueueSend(mqttsn_outgoing_cluster_message_queue, &queue_element, portMAX_DELAY) != pdPASS) {
    
    NRF_LOG_ERROR("Failed to post mqttsn message to outgoing message queue");
  
  }
  return NRF_SUCCESS;

}

uint32_t publish(char* topic_name, void* p_payload, uint8_t payload_size, uint8_t qos, uint16_t msg_id) {

  if (!mqttsn_client_is_connected()) {
    return NRF_ERROR_BUSY;
  }
  mqttsn_msg_queue_element_t msg;
  
  // find topic_id from topic_name
  msg.topic_id = get_topic_id(topic_name);
  if (msg.topic_id == NULL) {
    return NRF_ERROR_NULL;
  }
  msg.payload = p_payload;
  msg.payload_size = payload_size;
  msg.qos = qos;
  msg.msg_id = msg_id;

  if (mqttsn_outgoing_message_queue != NULL && xQueueSend(mqttsn_outgoing_message_queue, &msg, 10) != pdPASS) {
    
    NRF_LOG_ERROR("Failed to post mqttsn message to outgoing message queue");
  
  }
  return NRF_SUCCESS;
}

uint8_t mqttsn_client_is_connected() {
  if (!has_finished_connected_callback) {
    return 0;
  }
  mqttsn_client_state_t state = mqttsn_client_state_get(&m_client); // Calling mqttsn_client_state_get() before init will cause hardfault
  if (state == MQTTSN_CLIENT_CONNECTED) {
    return 1;
  }
  return 0;
}


void mqttsn_task(void *arg) {
  
  UNUSED_PARAMETER(arg);
  
  // Wait for thread stack task to initialize
  UNUSED_RETURN_VALUE(ulTaskNotifyTake(pdTRUE, portMAX_DELAY));

  mqttsn_outgoing_message_queue = xQueueCreate(MQTTSN_PACKET_FIFO_MAX_LENGTH, sizeof(mqttsn_msg_queue_element_t));
  mqttsn_outgoing_line_message_queue = xQueueCreate(MQTTSN_PACKET_FIFO_MAX_LENGTH, sizeof(mqttsn_line_msg_queue_element_t));
  mqttsn_outgoing_update_message_queue = xQueueCreate(MQTTSN_PACKET_FIFO_MAX_LENGTH, sizeof(mqttsn_update_msg_queue_element_t));
  mqttsn_outgoing_cluster_message_queue = xQueueCreate(MQTTSN_PACKET_FIFO_MAX_LENGTH, sizeof(mqttsn_cluster_msg_queue_element_t));

  if (mqttsn_outgoing_message_queue == NULL || mqttsn_outgoing_line_message_queue == NULL|| mqttsn_outgoing_update_message_queue == NULL || mqttsn_outgoing_cluster_message_queue == NULL) {
    NRF_LOG_ERROR("Not enough heap memory available for mqttsn task");
    while(1) {
      // do nothing
    }
  }

  for (uint8_t i=0; i<NUM_SUB_TOPICS; i++) {
    mqttsn_subscribe_topic_t* p_sub_topic = &sub_topic_arr[i];

    if (p_sub_topic->identifier == INIT_IDENTIFIER) {
      p_sub_topic->queue = xQueueCreate(p_sub_topic->queue_size, sizeof(mqttsn_init_msg_t));
    } 
    else if (p_sub_topic->identifier == TARGET_IDENTIFIER) {
      p_sub_topic->queue = xQueueCreate(p_sub_topic->queue_size, sizeof(mqttsn_target_msg_t));
    }

    if (p_sub_topic->queue == NULL) {
       NRF_LOG_ERROR("Not enough heap memory available for mqttsn task");
       while(1) {
        // do nothing
       }
    } else {
      vQueueAddToRegistry(p_sub_topic->queue, p_sub_topic->p_topic->p_topic_name);
    }

  }
  
  thread_bsp_init();
  mqttsn_init();

  TickType_t lastWakeTime;
  uint32_t err_code;

  while(1) {
    /*MQTTSN_CLIENT_UNINITIALIZED = 0,       < Client has not been initialized yet. */
    /*MQTTSN_CLIENT_ASLEEP,                  < Client is in sleep mode. */
    /*MQTTSN_CLIENT_AWAKE,                   < Client is awake. */
    /*MQTTSN_CLIENT_CONNECTED,               < Client is connected. */
    /*MQTTSN_CLIENT_DISCONNECTED,            < Client is disconnected. */
    /*MQTTSN_CLIENT_ESTABLISHING_CONNECTION, < Client is attempting to connect. */
    /*MQTTSN_CLIENT_WAITING_FOR_SLEEP,       < Client is waiting for permission to sleep. */
    /*MQTTSN_CLIENT_WAITING_FOR_DISCONNECT,  < Client is waiting for permission to disconnect. */

    mqttsn_client_state_t state = mqttsn_client_state_get(&m_client);

    while (state == MQTTSN_CLIENT_DISCONNECTED) {

      uint32_t err_code = mqttsn_client_search_gateway(&m_client, SEARCH_GATEWAY_TIMEOUT);
      if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("SEARCH GATEWAY message could not be sent. Error: 0x%x\r\n", err_code);
      }

      // Wait here until connect callback is executed
      UNUSED_RETURN_VALUE(ulTaskNotifyTake(pdTRUE, portMAX_DELAY)); 

      state = mqttsn_client_state_get(&m_client);
    }
    mqttsn_msg_queue_element_t rx_msg;
    mqttsn_line_msg_queue_element_t rx_line_msg;
    mqttsn_update_msg_queue_element_t rx_update_msg;
    mqttsn_cluster_msg_queue_element_t rx_cluster_msg;
    /*if (mqttsn_outgoing_message_queue != NULL && xQueueReceive(mqttsn_outgoing_message_queue, &rx_msg, 0) == pdPASS) {
      
      uint32_t err_code = mqttsn_client_publish(&m_client, rx_msg.topic_id, rx_msg.payload, rx_msg.payload_size, &rx_msg.msg_id);

