andersenthomas98/masteroppgave/nrf5sdk_thread/examples/thread/freertos_mqttsn/pca10056/blank/ses/thread_mqttsn.c
      if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("PUBLISH message could not be sent. Error code: 0x%x\r\n", err_code)
      }

    } else {
      taskYIELD();
    }*/
    
    while (mqttsn_outgoing_message_queue != NULL && xQueueReceive(mqttsn_outgoing_message_queue, &rx_msg, 0) == pdPASS) {

      uint32_t err_code = mqttsn_client_publish(&m_client, rx_msg.topic_id, rx_msg.payload, rx_msg.payload_size, rx_msg.qos, &rx_msg.msg_id);
    
      if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("PUBLISH message could not be sent. Error code: 0x%x\r\n", err_code)
      }

    }

    while (mqttsn_outgoing_line_message_queue != NULL && xQueueReceive(mqttsn_outgoing_line_message_queue, &rx_line_msg, 0) == pdPASS) {

      uint32_t err_code = mqttsn_client_publish(&m_client, rx_line_msg.topic_id, &rx_line_msg.payload, rx_line_msg.payload_size, rx_line_msg.qos, &rx_line_msg.msg_id);

      if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("PUBLISH message could not be sent. Error code: 0x%x\r\n", err_code)
      }
    }

    while(mqttsn_outgoing_update_message_queue != NULL && xQueueReceive(mqttsn_outgoing_update_message_queue, &rx_update_msg, 0) == pdPASS) {

      uint32_t err_code = mqttsn_client_publish(&m_client, rx_update_msg.topic_id, &rx_update_msg.payload, rx_update_msg.payload_size, rx_update_msg.qos, &rx_update_msg.msg_id);

      if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("PUBLISH message could not be sent. Error code: 0x%x\r\n", err_code)
      }
    }

    while(mqttsn_outgoing_cluster_message_queue != NULL && xQueueReceive(mqttsn_outgoing_cluster_message_queue, &rx_cluster_msg, 0) == pdPASS) {
      
      uint32_t err_code = mqttsn_client_publish(&m_client, rx_cluster_msg.topic_id, &rx_cluster_msg.payload, rx_cluster_msg.payload_size, rx_cluster_msg.qos, &rx_cluster_msg.msg_id);

      if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("PUBLISH message could not be sent. Error code: 0x%x\r\n", err_code)
      }
    }

    
    //lastWakeTime = xTaskGetTickCount();
    //vTaskDelayUntil(&lastWakeTime, configTICK_RATE_HZ*1);
    //taskYIELD();
    TickType_t lastWakeTime = xTaskGetTickCount();
    vTaskDelayUntil(&lastWakeTime, configTICK_RATE_HZ*0.1);
  
  }

}